---
title: RebarBendingDetailType
classe: Autodesk.Revit.DB.Structure.RebarBendingDetailType
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 32
---

# RebarBendingDetailType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get; set; }` | `rebarBendingDetailType.AngularDimensionsDisplayOption` | BendingDetailAngularDimensionsDisplayOptions |
| `Boolean AngularDimensionsEnabled { get; set; }` | `rebarBendingDetailType.AngularDimensionsEnabled` | Boolean |
| `Boolean AngularDimensionsForHooksEnabled { get; set; }` | `rebarBendingDetailType.AngularDimensionsForHooksEnabled` | Boolean |
| `BendingDetailAngularDimensionsMeasurementOptions AngularDimensionsMeasurementOptions { get; set; }` | `rebarBendingDetailType.AngularDimensionsMeasurementOptions` | BendingDetailAngularDimensionsMeasurementOptions |
| `Double AngularDimensionsOffset { get; set; }` | `rebarBendingDetailType.AngularDimensionsOffset` | Double |
| `BendingDetailDimensionTextPosition AngularDimensionTextPosition { get; set; }` | `rebarBendingDetailType.AngularDimensionTextPosition` | BendingDetailDimensionTextPosition |
| `ElementId AngularDimensionTypeId { get; set; }` | `rebarBendingDetailType.AngularDimensionTypeId` | ElementId |
| `Boolean BendDiameterDimensionsEnabled { get; set; }` | `rebarBendingDetailType.BendDiameterDimensionsEnabled` | Boolean |
| `Boolean BendDiameterDimensionsForHooksEnabled { get; set; }` | `rebarBendingDetailType.BendDiameterDimensionsForHooksEnabled` | Boolean |
| `Boolean BendDiameterDimensionsForSegmentsEnabled { get; set; }` | `rebarBendingDetailType.BendDiameterDimensionsForSegmentsEnabled` | Boolean |
| `BendingDetailBendDiameterDimensionType BendDiameterDimensionType { get; set; }` | `rebarBendingDetailType.BendDiameterDimensionType` | BendingDetailBendDiameterDimensionType |
| `BendingDetailLevelOfDetail DetailLevel { get; set; }` | `rebarBendingDetailType.DetailLevel` | BendingDetailLevelOfDetail |
| `ElementId DiameterDimensionTypeId { get; set; }` | `rebarBendingDetailType.DiameterDimensionTypeId` | ElementId |
| `BendingDetailDisplayMode DisplayMode { get; }` | `rebarBendingDetailType.DisplayMode` | BendingDetailDisplayMode |
| `BendingDetailTypeMultipleValuesIndicatorOptions MultipleValuesIndicatorOption { get; set; }` | `rebarBendingDetailType.MultipleValuesIndicatorOption` | BendingDetailTypeMultipleValuesIndicatorOptions |
| `Boolean OrthogonalAndOverallDimesionsEnabled { get; set; }` | `rebarBendingDetailType.OrthogonalAndOverallDimesionsEnabled` | Boolean |
| `ElementId RadialDimensionTypeId { get; set; }` | `rebarBendingDetailType.RadialDimensionTypeId` | ElementId |
| `BendingDetailFor3DShapesOptions RepresentaionOf3DShapes { get; set; }` | `rebarBendingDetailType.RepresentaionOf3DShapes` | BendingDetailFor3DShapesOptions |
| `Double SchematicHeight { get; set; }` | `rebarBendingDetailType.SchematicHeight` | Double |
| `Double SchematicWidth { get; set; }` | `rebarBendingDetailType.SchematicWidth` | Double |
| `Boolean SegmentLengthDimensionsEnabled { get; set; }` | `rebarBendingDetailType.SegmentLengthDimensionsEnabled` | Boolean |
| `Boolean SegmentLengthDimensionsForHooksEnabled { get; set; }` | `rebarBendingDetailType.SegmentLengthDimensionsForHooksEnabled` | Boolean |
| `Double SegmentLengthDimensionsOffset { get; set; }` | `rebarBendingDetailType.SegmentLengthDimensionsOffset` | Double |
| `BendingDetailDimensionTextPosition SegmentLengthDimensionTextPosition { get; set; }` | `rebarBendingDetailType.SegmentLengthDimensionTextPosition` | BendingDetailDimensionTextPosition |
| `ElementId SegmentLengthDimensionTypeId { get; set; }` | `rebarBendingDetailType.SegmentLengthDimensionTypeId` | ElementId |
| `BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption { get; set; }` | `rebarBendingDetailType.SegmentLengthsDisplayOption` | BendingDetailSegmentLengthsDisplayOptions |
| `BendingDetailSegmentLengthsDisplayOptions SegmentLengthsForArcsDisplayOption { get; set; }` | `rebarBendingDetailType.SegmentLengthsForArcsDisplayOption` | BendingDetailSegmentLengthsDisplayOptions |
| `BendingDetailSegmentsRepresentation SegmentsRepresentation { get; set; }` | `rebarBendingDetailType.SegmentsRepresentation` | BendingDetailSegmentsRepresentation |
| `ElementId TagTypeId { get; set; }` | `rebarBendingDetailType.TagTypeId` | ElementId |
| `RebarBendingDetailType Create(Document)` | `RebarBendingDetailType.Create(Document)` | RebarBendingDetailType |
| `RebarBendingDetailType CreateRealistic(Document)` | `RebarBendingDetailType.CreateRealistic(Document)` | RebarBendingDetailType |
| `RebarBendingDetailType CreateSchematic(Document)` | `RebarBendingDetailType.CreateSchematic(Document)` | RebarBendingDetailType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```